tap "jandedobbeleer/oh-my-posh"

# Terminal tools
brew "oh-my-posh"
brew "neovim"
brew "ripgrep"
brew "fzf"
brew "ack"
brew "tree"
brew "zoxide"
brew "git"
brew "mas"
brew "mosh"

# Git hosting CLIs
brew "gh"

# Development
brew "rbenv"
brew "nodenv"
brew "go"
brew "postgresql@18"
brew "luarocks"

# Fonts
cask "font-meslo-lg-nerd-font"

# CLI tools
cask "1password-cli"

# Apps
cask "iterm2"
cask "tailscale-app"
cask "obsidian"
cask "google-chrome"
cask "fastmail"
cask "voiceink"
cask "cap"
cask "slack"
cask "notion"
cask "monitorcontrol"
